#ifndef WRONG_PARKING
#define WRONG_PARKING

/*
Задача 1:
Служителите на Столична община, отговарящи за правилното паркиране на автомобилите в София имат затруднения 
при съставянето на глоби на неправилно паркираните автомобили. Те произлизат от това, че нужната информация се 
записва ръчно, а това отнема време и забавя работата на служителите. За целта те искат да могат да записват 
информацията на специално компютърно устройство с конзола.

Всяка глоба съдържа следната информация:
    - Описание на неправомерното паркиране
    - Регистрационен номер на автомобила
    - Размер на дължимата сума
    - Има ли други неплатени глоби, регистрирани на същия автомобил

Помогнете на служителите, като им дадете възможност да въвеждат тази информация от конзолата и да могат 
да я разглеждат след това. За сега нека програмата работи само за една глоба, а в последствие ще дадете 
на служителите правомощия да регистрират повече нарушения. 
*/

class WrongParking
{
public:
    WrongParking();
    WrongParking(const char*, const char*, const double, const bool);
    WrongParking(const WrongParking&);
    ~WrongParking();
private:
    char* description;
    char registrationPlate[9];
    double fine;
    bool hasWrongParkings;

    const unsigned SYMBOLS_IN_PLATE;
};

#endif