#include <iostream>
#include "Game.h"
/*
 * TODO list:
 * 1) Ябълката да си сменя позицията - Done
 * 2) Резултат от играта - Done
 * 3) Стени - Done
 * 4) Край на играта (когато се блъснем в стена или изядем себе си) - Done
 * 5) Файлове с high scores
 *  5.1) Записваме всички резултати последователно (неподредено) - Done
 *  5.2) Записваме всички резултати по брой точки
 *  5.3) Записваме само най-добрите 10 резултата
 * 6) Промени по архитектурата на играта
 */
int main() {
    Game game;
    game.draw();

    while(game.is_game_on())
    {
        game.update();
    }
    return 0;
}
